getAllEmployeeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://soapws.com/entity">
   <soapenv:Header/>
   <soapenv:Body>
      <ent:getAllEmployeeRequest/>
   </soapenv:Body>
</soapenv:Envelope>